# Manejo de multiples indices en un DF
    para el ejercicio se requiere descargar los datos del siguiente link:https://data.worldbank.org/ y en la pagina se busca: population total y se descarga el CSV.

Otra forma de convertir columnas con tipos de datos diferentes a categorias es mediante el siguiente codigo:

~~~
x['nombreColumna']=pd.Categorical(x ['nombreColumna'].apply(str))
~~~
___

Para definir multiples indices se utiliza el metodo __*.set_index()*__ en el que se definen los indices como una lista, adcionalmente

Se recomienda utilizar el metodo __*sort_index()*__ para que el DF quede ordenado por los indices, los cuales se pueden ordenar mediante la kwargs ascending, en la que se define mediante booleanos en una lista el orden de ordenado
___
Para realizar la busqueda de valores se puede realizar mediante el metodo __*.xs()*__

En este metodo, si se desea realizar la busqueda por un solo indice se debe establecer el nivel, es decir cada indice es un nivel

Por el contrario si se desea realizar la busqueda por varios indices se deben incluir como una lista.
___
Para realizar slices del df con varios indices, se puede utilizar la funcion __*pd.IndexSlices*__: la cual permite definir mediante notación de slices, los filtros para cada indice, separados por ,

Sin embargo, por convención esta funcion debe ser guardada en una funcion la cual es invocada al momento de la ejecución con el metodo .loc; por ejemplo

~~~
ids = pd.IndexSlices
x.loc[ids['slice 1 indice', 'slice 2 indice', :]].sort_index()
~~~
___
para obtener el listado de todos los valores de los indices se utiliza el siguiente codigo:

    x.index.get_level_values(0)
En donde el numero define el indice que se va a listar.

___
La principal utilidad de los multiples indices es la generación de calculos de acuerdo a los indices de manera que para cada operación se utilice kwargs level y se defina el indice.
___

Si se desea trabajar con los datos como una matriz (solo con 2 indices), se puede utilizar el metodo __*.unstack*__

In [1]:
import pandas as pd
import numpy as np

pd.__version__

'1.4.0'

In [2]:
!ls

1inicio.ipynb	    4multiplesIndices.ipynb  magicCommands.ipynb  worldBank
2dataframe.ipynb    Meteorite_Landings.csv   poblacion.csv	  worldBank.zip
3operaciones.ipynb  london_merged.csv	     test.csv

In [3]:
df_pop = pd.read_csv('poblacion.csv')

In [4]:
# para cambiar el tipo de notación de los numeros:

pd.options.display.float_format = '{:,.2f}'.format

In [5]:
df_pop['year']=pd.Categorical(df_pop['year'].apply(str))
df_pop.convert_dtypes().dtypes

Country      string
year       category
pop           Int64
dtype: object

In [10]:
index_filter = df_pop['Country'].isin(['Aruba', 'Colombia'])
index_filter.sample(5)

425    False
110    False
97     False
942    False
372    False
Name: Country, dtype: bool

In [27]:
sample = df_pop[index_filter]
sample.sample(5)

      Country  year           pop
9       Aruba  2015    104,341.00
789     Aruba  2018    105,845.00
42   Colombia  2015 47,520,667.00
269     Aruba  2016    104,872.00
302  Colombia  2016 48,171,392.00

In [28]:
sample = sample.set_index(['Country','year']).sort_index()
sample

                        pop
Country  year
Aruba    2015    104,341.00
         2016    104,872.00
         2017    105,366.00
         2018    105,845.00
Colombia 2015 47,520,667.00
         2016 48,171,392.00
         2017 48,901,066.00
         2018 49,648,685.00

                        pop
Country  year
Aruba    2015    104,341.00
         2016    104,872.00
         2017    105,366.00
         2018    105,845.00
Colombia 2015 47,520,667.00
         2016 48,171,392.00
         2017 48,901,066.00
         2018 49,648,685.00

In [30]:
# para buscar por un indice especifico:

sample.loc['Colombia', :].loc['2016']

pop   48,171,392.00
Name: 2016, dtype: float64

In [35]:
sample.xs(['Aruba', '2016'])

/tmp/ipykernel_1679/3792012293.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  sample.xs(['Aruba', '2016'])

pop   104,872.00
Name: (Aruba, 2016), dtype: float64

In [37]:
sample.xs('2016', level='year')

                   pop
Country
Aruba       104,872.00
Colombia 48,171,392.00

In [40]:
countries= df_pop.set_index(['Country','year']).sort_index()
countries.sample(10)

                                                             pop
Country                                      year
Euro area                                    2017 341,164,362.00
Cote d'Ivoire                                2017  24,437,469.00
Bermuda                                      2017      63,874.00
Panama                                       2017   4,106,771.00
Comoros                                      2018     832,322.00
South Sudan                                  2017  10,910,759.00
Romania                                      2018  19,473,936.00
Kosovo                                       2017   1,830,700.00
Mauritius                                    2015   1,262,605.00
Least developed countries: UN classification 2016 963,511,276.00

In [45]:
ids = pd.IndexSlice

countries.loc[pd.IndexSlice['Aruba':'Austria','2015':'2017'],:].sort_index()

                         pop
Country   year
Aruba     2015    104,341.00
          2016    104,872.00
          2017    105,366.00
Australia 2015 23,815,995.00
          2016 24,190,907.00
          2017 24,601,860.00
Austria   2015  8,642,699.00
          2016  8,736,668.00
          2017  8,797,566.00

In [47]:
countries.index.get_level_values(0)

Index(['Afghanistan', 'Afghanistan', 'Afghanistan', 'Afghanistan', 'Albania',
       'Albania', 'Albania', 'Albania', 'Algeria', 'Algeria',
       ...
       'Yemen, Rep.', 'Yemen, Rep.', 'Zambia', 'Zambia', 'Zambia', 'Zambia',
       'Zimbabwe', 'Zimbabwe', 'Zimbabwe', 'Zimbabwe'],
      dtype='object', name='Country', length=1040)

In [48]:
countries.index.get_level_values(1)

CategoricalIndex(['2015', '2016', '2017', '2018', '2015', '2016', '2017',
                  '2018', '2015', '2016',
                  ...
                  '2017', '2018', '2015', '2016', '2017', '2018', '2015',
                  '2016', '2017', '2018'],
                 categories=['2015', '2016', '2017', '2018'], ordered=False, dtype='category', name='year', length=1040)

In [50]:
countries.sum(level='year')

/tmp/ipykernel_1679/978479506.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  countries.sum(level='year')

                   pop
year
2015 65,679,147,019.00
2016 66,487,930,677.00
2017 67,294,176,701.00
2018 68,087,886,692.00

In [51]:
countries.unstack()

                                pop
year                           2015          2016          2017          2018
Country
Afghanistan           34,413,603.00 35,383,128.00 36,296,400.00 37,172,386.00
Albania                2,880,703.00  2,876,101.00  2,873,457.00  2,866,376.00
Algeria               39,728,025.00 40,551,404.00 41,389,198.00 42,228,429.00
American Samoa            55,812.00     55,741.00     55,620.00     55,465.00
Andorra                   78,011.00     77,297.00     77,001.00     77,006.00
...                             ...           ...           ...           ...
Virgin Islands (U.S.)    107,710.00    107,510.00    107,268.00    106,977.00
West Bank and Gaza     4,270,092.00  4,367,088.00  4,454,805.00  4,569,087.00
Yemen, Rep.           26,497,889.00 27,168,210.00 27,834,821.00 28,498,687.00
Zambia                15,879,361.00 16,363,507.00 16,853,688.00 17,351,822.00
Zimbabwe              13,814,629.00 14,030,390.00 14,236,745.00 14,439,018.00

[260 rows x 4 columns]